<?php

/**
Кейс ООП
Предположим, у нас есть класс Fruit. Fruit может иметь такие свойства, как имя, цвет, вес и т. д. Мы можем определить такие переменные, как $name, $color и $weight, чтобы хранить значения этих свойств.

Когда создаются отдельные объекты (яблоко, банан и т. д.), они наследуют все свойства и поведение класса, но каждый объект будет иметь разные значения свойств.
 */



/**
Определить класс
Класс определяется с помощью class ключевого слова, за которым следует имя класса и пара фигурных скобок ({}). Все его свойства и методы заключаются в фигурные скобки:
 */

class FirstClass
{

}
